Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70J21.PIC
      <edc:AdjustPoint edc:_addr="0xE000EDA4" edc:offset="0x15C"/>
      <edc:SFRDef edc:_addr="0xE000EF00" edc:access="-----------------------nnnnnnnnn" edc:cname="NVICSTIR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTID" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3." edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EF04" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0xE000EF34" edc:access="nn---------------------n-nnnn-nn" edc:cname="FPCCR" edc:mclr="11000000000000000000000000000000" edc:nzwidth="0x20" edc:por="11000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LSPACT" edc:desc="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER" edc:desc="Privilege level was user when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THREAD" edc:desc="Mode was Thread Mode when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFRDY" edc:desc="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMRDY" edc:desc="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BFRDY" edc:desc="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONRDY" edc:desc="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="LSPEN" edc:desc="Enable automatic lazy state preservation for floating-point context." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASPEN" edc:desc="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:cname="FPCAR" edc:nzwidth="0x20" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="The location of the unpopulated floating-point register space allocated on an exception stack frame." edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EF3C" edc:access="-----nnnnn----------------------" edc:cname="FPDSCR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="RMode" edc:desc="Default value for FPSCR.RMode." edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FZ" edc:desc="Default value for FPSCR.FZ." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DN" edc:desc="Default value for FPSCR.DN." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AHP" edc:desc="Default value for FPSCR.AHP." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SQIDataSector edc:beginaddr="0x80000000" edc:endaddr="0xA0000000" edc:regionid="QSPIMEM"/>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x200000" edc:regionid="ITCM"/>
    <edc:CodeSector edc:beginaddr="0x400000" edc:endaddr="0x600000" edc:regionid="IFLASH"/>
    <edc:BootConfigSector edc:beginaddr="0x800000" edc:endaddr="0x804000" edc:regionid="IROM"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20020000" edc:regionid="DTCM"/>
    <edc:GPRDataSector edc:beginaddr="0x20400000" edc:endaddr="0x20460000" edc:regionid="IRAM"/>
    <edc:EBIDataSector edc:beginaddr="0x60000000" edc:endaddr="0x61000000" edc:regionid="EBI_CS0"/>
    <edc:EBIDataSector edc:beginaddr="0x61000000" edc:endaddr="0x62000000" edc:regionid="EBI_CS1"/>
    <edc:EBIDataSector edc:beginaddr="0x62000000" edc:endaddr="0x63000000" edc:regionid="EBI_CS2"/>
    <edc:EBIDataSector edc:beginaddr="0x63000000" edc:endaddr="0x64000000" edc:regionid="EBI_CS3"/>
    <edc:DDRSector edc:beginaddr="0x70000000" edc:endaddr="0x80000000" edc:regionid="SDRAM_CS"/>
    <edc:DeviceIDSector edc:beginaddr="0x400E0940" edc:endaddr="0x400E0944" edc:mask="0xFFFFFFE0" edc:regionid="devid" edc:value="0xA1120E00"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace edc:magicoffset="0xD0000000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="fuses">
      <edc:DCRDef edc:_addr="0x0" edc:access="------nn" edc:cname="GPNVMBITS" edc:factorydefault="0x0" edc:impl="0x3" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SECURITY_BIT" edc:desc="Security Bit" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOT_MODE" edc:desc="Boot Mode Selection" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0xD0000004">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x10" edc:regionid="lockbits">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD0" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_0" edc:desc="Lock Region 0" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_1" edc:desc="Lock Region 1" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_2" edc:desc="Lock Region 2" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_3" edc:desc="Lock Region 3" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_4" edc:desc="Lock Region 4" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_5" edc:desc="Lock Region 5" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_6" edc:desc="Lock Region 6" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_7" edc:desc="Lock Region 7" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_8" edc:desc="Lock Region 8" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_9" edc:desc="Lock Region 9" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_10" edc:desc="Lock Region 10" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_11" edc:desc="Lock Region 11" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_12" edc:desc="Lock Region 12" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_13" edc:desc="Lock Region 13" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_14" edc:desc="Lock Region 14" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_15" edc:desc="Lock Region 15" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_16" edc:desc="Lock Region 16" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_17" edc:desc="Lock Region 17" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_18" edc:desc="Lock Region 18" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_19" edc:desc="Lock Region 19" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_20" edc:desc="Lock Region 20" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_21" edc:desc="Lock Region 21" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_22" edc:desc="Lock Region 22" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_23" edc:desc="Lock Region 23" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_24" edc:desc="Lock Region 24" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_25" edc:desc="Lock Region 25" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_26" edc:desc="Lock Region 26" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_27" edc:desc="Lock Region 27" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_28" edc:desc="Lock Region 28" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_29" edc:desc="Lock Region 29" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_30" edc:desc="Lock Region 30" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_31" edc:desc="Lock Region 31" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD1" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_32" edc:desc="Lock Region 32" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_33" edc:desc="Lock Region 33" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_34" edc:desc="Lock Region 34" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_35" edc:desc="Lock Region 35" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_36" edc:desc="Lock Region 36" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_37" edc:desc="Lock Region 37" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_38" edc:desc="Lock Region 38" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_39" edc:desc="Lock Region 39" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_40" edc:desc="Lock Region 40" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_41" edc:desc="Lock Region 41" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_42" edc:desc="Lock Region 42" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_43" edc:desc="Lock Region 43" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_44" edc:desc="Lock Region 44" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_45" edc:desc="Lock Region 45" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_46" edc:desc="Lock Region 46" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_47" edc:desc="Lock Region 47" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_48" edc:desc="Lock Region 48" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_49" edc:desc="Lock Region 49" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_50" edc:desc="Lock Region 50" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_51" edc:desc="Lock Region 51" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_52" edc:desc="Lock Region 52" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_53" edc:desc="Lock Region 53" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_54" edc:desc="Lock Region 54" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_55" edc:desc="Lock Region 55" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_56" edc:desc="Lock Region 56" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_57" edc:desc="Lock Region 57" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_58" edc:desc="Lock Region 58" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_59" edc:desc="Lock Region 59" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_60" edc:desc="Lock Region 60" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_61" edc:desc="Lock Region 61" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_62" edc:desc="Lock Region 62" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_63" edc:desc="Lock Region 63" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD2" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_64" edc:desc="Lock Region 64" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_65" edc:desc="Lock Region 65" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_66" edc:desc="Lock Region 66" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_67" edc:desc="Lock Region 67" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_68" edc:desc="Lock Region 68" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_69" edc:desc="Lock Region 69" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_70" edc:desc="Lock Region 70" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_71" edc:desc="Lock Region 71" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_72" edc:desc="Lock Region 72" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_73" edc:desc="Lock Region 73" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_74" edc:desc="Lock Region 74" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_75" edc:desc="Lock Region 75" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_76" edc:desc="Lock Region 76" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_77" edc:desc="Lock Region 77" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_78" edc:desc="Lock Region 78" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_79" edc:desc="Lock Region 79" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_80" edc:desc="Lock Region 80" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_81" edc:desc="Lock Region 81" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_82" edc:desc="Lock Region 82" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_83" edc:desc="Lock Region 83" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_84" edc:desc="Lock Region 84" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_85" edc:desc="Lock Region 85" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_86" edc:desc="Lock Region 86" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_87" edc:desc="Lock Region 87" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_88" edc:desc="Lock Region 88" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_89" edc:desc="Lock Region 89" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_90" edc:desc="Lock Region 90" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_91" edc:desc="Lock Region 91" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_92" edc:desc="Lock Region 92" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_93" edc:desc="Lock Region 93" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_94" edc:desc="Lock Region 94" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_95" edc:desc="Lock Region 95" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0xC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD3" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_96" edc:desc="Lock Region 96" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_97" edc:desc="Lock Region 97" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_98" edc:desc="Lock Region 98" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_99" edc:desc="Lock Region 99" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_100" edc:desc="Lock Region 100" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_101" edc:desc="Lock Region 101" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_102" edc:desc="Lock Region 102" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_103" edc:desc="Lock Region 103" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_104" edc:desc="Lock Region 104" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_105" edc:desc="Lock Region 105" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_106" edc:desc="Lock Region 106" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_107" edc:desc="Lock Region 107" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_108" edc:desc="Lock Region 108" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_109" edc:desc="Lock Region 109" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_110" edc:desc="Lock Region 110" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_111" edc:desc="Lock Region 111" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_112" edc:desc="Lock Region 112" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_113" edc:desc="Lock Region 113" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_114" edc:desc="Lock Region 114" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_115" edc:desc="Lock Region 115" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_116" edc:desc="Lock Region 116" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_117" edc:desc="Lock Region 117" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_118" edc:desc="Lock Region 118" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_119" edc:desc="Lock Region 119" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_120" edc:desc="Lock Region 120" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_121" edc:desc="Lock Region 121" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_122" edc:desc="Lock Region 122" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_123" edc:desc="Lock Region 123" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_124" edc:desc="Lock Region 124" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_125" edc:desc="Lock Region 125" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_126" edc:desc="Lock Region 126" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_127" edc:desc="Lock Region 127" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C"/>
    </edc:Pin>
